lesTurbGenBC/testCase/0/B
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    object      B;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0 0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0 0 0 0 0 0 0);
        value           uniform (0 0 0 0 0 0 0 0 0);
    }

    ground
    {
        type            zeroGradient;
    }

    sides
    {
        type            symmetry;
    }

    top
    {
        type            symmetry;
    }

}

// ************************************************************************* //
