lesTurbGenBC/testCase/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"
#include "../parameters"

fields (U);
probeLocations
(
    ($P0X $P0Y $P0Z)
    ($P1X $P1Y $P1Z)
    ($P2X $P2Y $P2Z)
    ($P3X $P3Y $P3Z)
);

// ************************************************************************* //
